package com.ltqh.qh.entity;

import java.util.List;

public class BookContentEntity {

    /**
     * resultcode : 200
     * reason : Success
     * result : {"data":[{"title":"于丹：重温最美古诗词","catalog":"中国文学 散文 ","tags":"中国传统文化 古典诗词赏析 好书推荐 文学诗词名著 ","sub1":"《于丹：重温最美古诗词》","sub2":"中国古典文化博大精深、源远流长，特别是古典诗词，堪称中华古典文学的瑰宝。作为一个中国人，诗歌陪伴着我们逐渐成长。小时候，牙牙学语的我们就会摇头晃脑、一本正经地背诵着李白的\u201c床前明月光，疑是地上霜\u201d了；长大一点，我们就在\u201c小荷才露尖尖角\u201d的诗歌中无忧无虑地度过了美好的童年时光；长大后，我们开始在爱情的道路上深情吟唱\u201c春蚕到死丝方尽，蜡炬成灰泪始干\u201d，在忙碌的工作中追求\u201c采菊东篱下，悠然见南山\u201d的悠然\u2026\u2026也许到岁月在我们的脸上刻上深深的皱纹的时候，我们依然会在\u201c流光容易把人抛，红了樱桃，绿了芭蕉\u201d的诗歌中感叹这似水的年华\u2026\u2026林语堂说：\u201c诗歌是中国人的宗教。\u201d 小编觉得，这个比喻还是蛮贴切的。 《于丹：重温最美古诗词》是于丹老师以17年古诗词教学积淀厚积薄发而成的文学著作。于丹老师回归古典文学专业，重温最美古诗词，回归自在大人生，让传统文化的精髓进一步走近大众，走近当下中国人的精神世界。作品中，于丹老师以其独特的人文风格对中国古诗词意象、风骨、内涵、感悟进行了一系列的鉴赏解读，文字清新优美、通俗易懂又妙语连珠，很能激起读者的共鸣。 《于丹：重温最美古诗词》作者于丹，著名文化学者，是北京师范大学教授和博士生导师，更是中国传统文化的研究者和传播者。于丹老师曾在中央电视台《百家讲坛》、《文化视点》等栏目进行系列讲座，掀起学习经典的热潮，在海内外文化界、教育界均产生了广泛的影响。 于丹老师说：\u201c我一直深深地相信，每一个中国人生命的深处都蛰伏着诗意，也许人的年岁越长越需要这样一种温暖，需要我们生命年华中的浪漫，让我们从现实的纠葛中拥有一种挣脱地心引力的力量。\u201d所以，《于丹：重温最美古诗词》一书就让我们重温中国传统文学和古典哲学的精髓所在，找回心灵深处的宁静之美。 \u201c寻常日子一旦有趣，就变得兴味盎然；寻常日子一旦有心，身边处处都是田园。\u201d 不同于安意如的小家碧玉，于丹时而温婉、时而豪放，将\u201c春风飞扬，秋思浩荡，明月千古，斜阳晚钟，田园林泉，登临况味，剑啸长虹，诗酒流连\u201d等解读得淋漓尽致，深入人心，让人沉醉其中，流连忘返\u2026\u2026 《于丹：重温最美古诗词》","img":"http://apis.juhe.cn/goodbook/img/8a0ee76f52d0cf7f28d0eb767946e343.jpg","reading":"8370人阅读","online":"京东商城:http://book.jd.com/10913523.html 当当网:http://product.dangdang.com/product.aspx?product_id=22742915 亚马逊:http://www.amazon.cn/%E4%BA%8E%E4%B8%B9-%E9%87%8D%E6%B8%A9%E6%9C%80%E7%BE%8E%E5%8F%A4%E8%AF%97%E8%AF%8D-%E4%BA%8E%E4%B8%B9/dp/B006Z51Q4I/ref=sr_1_1?ie=UTF8&amp;qid=1367548030&amp;sr=8-1&amp;keywords=%E3%80%8A%E4%BA%8E%E4%B8%B9%EF%BC%9A%E9%87%8D%E6%B8%A9%E6%9C%80%E7%BE%8E%E5%8F%A4%E8%AF%97%E8%AF%8D%E3%80%8B 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_1649112_.html","bytime":"2013年5月3日"},{"title":"许三观卖血记","catalog":"中国文学 小说 ","tags":"中国当代文学 中国文学名著 人生 民间小说 经典好书推荐 ","sub1":"余华巨著：《许三观卖血记》","sub2":"《许三观卖血记》是中国当代著名作家余华于1995年创作的一部长篇小说。作品以博大的温情描绘了磨难中的人生，以激烈的故事形式表达了人在面对厄运时求生的欲望。小说中的人生充满了苦难和痛苦，却渗透了一种契诃夫式的悲悯情绪，令读者一唱三叹、回味无穷。 《许三观卖血记》是一部精妙绝伦的小说，是朴实简洁和内涵意蕴深远的完美结合。作者余华，于1960年出生在浙江杭州，后迁居浙江海盐，现定居浙江杭州。在其青春成长期间，学习了一回鲁迅先生，弃医从文。从文后先后发表了很多作品，被翻译为多种文字，畅销国内外，对社会的影响颇深，因此也获得了许许多多的奖项，享誉中外。其文学代表作有《活着》、《许三观卖血记》、《在细雨中呼喊》、《兄弟》等等。 《许三观卖血记》一书中的故事发生在中国解放初的五六十年代，主人公许三观是一个有着好奇心和责任心的青年，为了生活，他拼命工作，但依然无法保证生活。于是，他就去卖血，靠着卖血，他渡过了人生的一个个难关，也一次次战胜了命运强加给他的惊涛骇浪。后来，他老了，无法卖血了，他坐着哭了，感觉人生走到了尽头\u2026\u2026 在这部感人肺腑的小说里，没有绚烂的情节，有的只是一个简单的民间故事：一个中国家庭忍受贫穷、饥荒以及随后的文化大革命\u2026\u2026虽然小说充满了辛酸，却也不乏幽默之处，这充分展现了余华令人惊悚而滑稽的写作风格。 作者余华说：\u201c这本书其实是一首很长的民歌，它的节奏是回忆的速度，旋律温和地跳跃着，休止符被韵脚隐藏了起来。\u201d 让我们轻轻吟唱起这首民歌，走进这部颇具形式美感的文学作品，去体会中国近代贫苦老百姓们的苦难人生\u2026\u2026 《许三观卖血记》","img":"http://apis.juhe.cn/goodbook/img/3d9a8dd4affd3930ddfb3e056889a56c.jpg","reading":"5350人阅读","online":"京东商城:http://book.jd.com/11139510.html 亚马逊:http://www.amazon.cn/%E8%AE%B8%E4%B8%89%E8%A7%82%E5%8D%96%E8%A1%80%E8%AE%B0-%E4%BD%99%E5%8D%8E/dp/B004TJN5DW/ref=sr_1_2","bytime":"2013年5月22日"},{"title":"世间所有相遇都是久别重逢","catalog":"中国文学 散文 ","tags":"优美散文随笔 古典诗词赏析 好书 散文随笔推荐 禅道 ","sub1":"《世间所有相遇都是久别重逢》","sub2":"\u201c如何让你遇见我？在我最美丽的时刻。 为这，我已在佛前，求了五百年，求它让我们结一段尘缘\u2026\u2026\u201d 一直以来都很喜欢这首诗，席慕容的《一棵开花的树》，每一次轻声念道，心灵都会微微地被触动，升起一股说不出道不明的莫名情绪\u2026\u2026佛说，前世五百年的回眸，才换来今生的擦肩而过。亦有\u201c百年修得同船渡，千年修得共枕眠\u201d一说。前世今生，百转千回，原来世间所有相遇都是久别重逢。或许，五百年前，我就是默默站立在你身旁的那棵树\u2026\u2026 《世间所有相遇都是久别重逢》是享有\u201c落梅风骨，秋水文章\u201d之称的中国作家白落梅以最唯美的文字解读史上最经典的佛诗佛词的一部散文随笔。作品以以禅为经，以诗为纬，编织出一幅最为清新亮丽的画面。白落梅以诗悟禅，以禅入诗，将淡雅之味、悠长之韵、深刻之理、通俗之句皆描绘得淋漓尽致，禅机顿显、诗意盎然，好不惬意。 \u201c文字清淡，心似兰草\u201d的白落梅，原名胥智慧，是一个凌霜傲雪、拣尽梅枝的女子。她的文学作品常见于《读者》等杂志，其散文在CCTV3《电视诗歌散文》栏目中已播出近40篇，出版的代表作有《恍若梦中一相逢》、《烟月不知人事改》、《在最深的红尘里重逢\u2014\u2014仓央嘉措诗传》、《你若安好便是晴天：林徽因传》、《西风多少恨 吹不散眉弯》、《你是锦瑟 我为流年》等等。 在《世间所有相遇都是久别重逢》一书中，隐世才女白落梅以禅意写红尘，以佛法道人生，文字空灵婉约、淡雅脱尘，极富禅意，具有超凡脱俗直指人心的韵味。\u201c我是这样的无意，在一扇半开半掩的轩窗下，让禅意的文字，盛开在许多个宁静的夜里。不是为了给某个故事，埋下深沉的伏笔，只为了在众生的心底，栽种一株菩提。请相信，世间所有相遇，都是久别重逢。也许我是你前世一直无法破解的棋局，你是我今生永远不能猜透的谜底。\u201d\u2026\u2026 一念起，万水千山皆有情；一念灭，沧海桑田已无心。佛说，缘深则聚，缘浅则分，万法随缘，不求则不苦。所以遇见所有遇见的，拥有可以拥有的，忘记需要忘记的，才能换来岁月静好，现世安稳。 因为《世间所有相遇都是久别重逢》 ，所以让我们跟随白落梅的脚步，在那亦禅亦诗、颇具灵性的文字中，去追溯诗缘词梦，去寻找那一次次久别重逢\u2026\u2026 《世间所有相遇都是久别重逢》","img":"http://apis.juhe.cn/goodbook/img/cb3236e4798011682d3d4bff1e575f21.jpg","reading":"10730人阅读","online":"京东商城:http://book.jd.com/10379459.html 当当网:http://product.dangdang.com/product.aspx?product_id=21018087 亚马逊:http://www.amazon.cn/dp/B004HEXD18 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_860946_.html","bytime":"2013年4月4日"},{"title":"京华烟云","catalog":"中国文学 小说 经典名著 ","tags":"中国文学名著 中国近代历史 值得看的好书 小说推荐 经典好书推荐 ","sub1":"现代版\u201c红楼梦\u201d：《京华烟云》","sub2":"《京华烟云》是华语文坛最幽默睿智的一支笔、一代国学大师林语堂先生最负盛名的传世之作，是一部全景式展现中国风云变幻的人文、社会和文化的史诗巨著，更有现代版\u201c红楼梦\u201d的美称。作品讲述了北平曾、姚、牛三大家族从1901年义和团运动到抗日战争30多年间的命运浮沉、悲欢离合和恩怨情仇，曾获得诺贝尔文学奖提名，是一部关于现代中国社会现实的经典小说。 《京华烟云》是国学大师林语堂先生旅居法国巴黎时于1938年8月至1939年8月间用英文创作的长篇小说，原书名为《Moment in Peking》。林语堂先生是中国现代著名的学者、语言学家、文学家和哲学家，他的著名代表作有《京华烟云》、《风声鹤唳》、《吾国与吾民》、《人生不过如此》、《生活的艺术》和《人生的盛宴》等。林语堂先生一生著作等身，享誉中外，在世界文坛上拥有重要的地位。 《京华烟云》是献给\u201c英勇的中国士兵\u201d的一部伟大著作。小说仿照《红楼梦》的结构，以真挚饱满的情感、严肃而又幽默的文笔，讲述了北平曾、姚、牛三大家族30年间的历史变迁，写出了袁世凯篡国、张勋复辟、直奉大战、军阀割据、\u201c五四\u201d运动、\u201c三·一八\u201d惨案、青年\u201c左倾\u201d、二战爆发等近半个世纪的中国历史事件，全面地展现了现代中国真实的社会状况，吸引了一代又一代爱好历史的读者们。 《京华烟云》一书集佳话、哲学、历史演义、风俗变迁、深谈、闲话于一身，再加上剧中人物的喜怒哀乐和过渡时代的中国风貌，俨然成为了现代中国的一本伟大的小说。诺贝尔文学奖获得者赛珍珠评价此书说：\u201c它实事求是，不为真实而羞愧。它写得美妙，既严肃又欢快，对古今中国都能给予正确的理解和评价。我认为这是迄今为止最真实、最深刻、最完备、最重要的一部关于中国的著作。\u201d 《京华烟云》是\u201c林语堂三部曲\u201d之一。本书献词为：\u201c全书写罢泪涔涔，献予歼倭抗日人。不是英雄流热血，神州谁是自由民。\u201d 可见，它是一部饱含深情地献给抗日英雄的巨著。林语堂先生说：\u201c诚盼此书将给予吾人以深刻的启示，将我们深植于往昔的根蒂，开出灿丽的鲜花！\u201d 那么，就让我们走进现代版\u201c红楼梦\u201d\u2014\u2014《京华烟云》，去了解中国历史的变迁，去体会书中人物的悲欢离合，感受他们的酸甜苦辣\u2026\u2026 《京华烟云》","img":"http://apis.juhe.cn/goodbook/img/8de57bb8f82c0f31035d25e48644f3dd.jpg","reading":"3754人阅读","online":"京东商城:http://book.jd.com/10862584.html 当当网:http://product.dangdang.com/product.aspx?product_id=22553275 亚马逊:http://www.amazon.cn/dp/B006BO864G 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_2510555_.html","bytime":"2013年4月12日"},{"title":"倾城之恋","catalog":"中国文学 小说 ","tags":"中国文学经典 好书推荐 爱情 经典爱情小说 ","sub1":"张爱玲著名小说：《倾城之恋》","sub2":"《倾城之恋》是中国现代著名作家张爱玲创作的著名小说，也是她的成名作和经典代表作。《倾城之恋》讲述了一对现实中的庸俗男女在兵荒马乱的战争年代上演的一幕倾城之恋，叙述了一个动听而又近人情的爱情故事。此部作品是张爱玲最脍炙人口的文学著作之一，奠定了张爱玲在中国文坛上的重要地位。 《倾城之恋》的爱情故事发生在香港。女主角白流苏原是上海的白家小姐，在经历过一次失败的婚姻后，身无分文的她备受亲戚们的冷嘲热讽。在她失望之余，从此变得冷漠，看尽世态炎凉。一次偶然的机会，她与男主人公范柳原\u2014\u2014一个多金潇洒的单身汉结识，于是孤注一掷，远赴香港，追求范柳原的爱与婚姻。他们两个情场高手在浅水湾饭店斗智斗勇，最终白流苏服输了。但在日军开始轰炸浅水湾时，范柳原打消了离开的念头，回来保护白流苏。在生死攸关时，两人于\u201c一刹那\u201d间体会到了\u201c一对平凡的夫妻\u201d之间的\u201c一点真心\u201d，最后终于结婚了。但是婚姻并不能改变范柳原之前的生活习惯与作风，白流苏也只能睁只眼闭只眼\u2026\u2026 《倾城之恋》的作者张爱玲是中国现代最重要的作家，也是五四以来最优秀的作家。张爱玲原名张瑛，于1920年9月30日出生在上海公共租界西区。张爱玲家世显赫，童年时光却是黑暗的。她的生母流浪欧洲，她和弟弟是在后娘的监管下长大的，所以导致她的文学作品充满了悲观与势利。张爱玲一生创作了大量的文学作品，有小说、散文、电影剧本以及文学论著等，而她的经典代表作有《金锁记》、《倾城之恋》、《半生缘》和《红玫瑰与白玫瑰》等等。1995年09月08日，张爱玲于洛杉矶加州逝世，享年75岁。 《倾城之恋》是张爱玲最为倾心的作品之一，张爱玲以独特的韵味和情致讲述了一对痴男怨女纠缠不清的爱情故事。著名作家王安忆说：\u201c她有足够的情感能力去抵达深刻，可她没有勇敢承受这种能力所获得的结果，这结果太沉重，她是很知道这分量的。于是她便觉攫住自己，束缚在一些生活的可爱的细节，拼命去吸吮它的实在之处，以免自己再滑到虚无的边缘。\u201d 原本是一场自私而畸形的爱情交易，却因为战争，让两人相嚅以沫、生死相依。\u201c别的她不知道，在这一刹那，她只有他，他也只有她\u2026\u2026\u201d 品读《倾城之恋》，看张爱玲如何看透人性、看透人生\u2026\u2026 《倾城之恋》","img":"http://apis.juhe.cn/goodbook/img/c80c7e316e3dc366ce8b5f321461642f.jpg","reading":"4913人阅读","online":"京东商城:http://book.360buy.com/11020132.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22782677 亚马逊:http://www.amazon.cn/dp/B0084XA1JA 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_2170861_.html","bytime":"2013年3月5日"},{"title":"人生","catalog":"中国文学 小说 经典名著 ","tags":"励志小说 小说排行榜 经典好书推荐 茅盾文学奖 ","sub1":"路遥经典著作：《人生》","sub2":"《人生》是中国当代著名作家路遥的成名作，一部以改革时期陕北高原的城乡生活为背景的优秀中篇小说。作品描写了高中毕业生高加林在农村与城市中几度徘徊的故事，亦描写了高加林同农村姑娘刘巧珍、城市姑娘黄亚萍之间的感情纠葛。小说将理想与现实之间的矛盾描写得淋淋尽致，给人带来一种无奈的无力感的同时，引人深思。 《人生》是真正奠定路遥创作基础的一部经典作品。路遥，原名王卫国，中国当代农村作家，生于1949年陕北一个贫穷的农民家庭里。路遥于1973年进入延安大学中文系学习，在学习期间开始文学创作，后任《陕西文艺》（今为《延河》）编辑。路遥的文学代表作有1982年发表的《人生》、1988年发表的百万字长篇巨著《平凡的世界》等，曾获得第三届茅盾文学奖。 《人生》一书以朴实的语言描写了出生于农村却自信坚毅、拥有远大理想和抱负的主人公高加林离开土地又回到土地、再离开土地再回到土地的命运。高加林辛勤、朴实却心性极高，他不断向命运挑战却最终不得不臣服于命运。小说刻画了他这个复杂矛盾的人物形象，体现了在那个时代背景下那种艰难选择的悲剧。 \u201c人生的道路虽然慢长，但紧要处常常只有几步，特别是当人年轻的时候。没有一个人的生活道路是笔直的，没有岔道的。有些岔道口，譬如政治上的岔口，事业上的岔道口，个人生活上岔道口，你走错一步，可以影响人生的一个时期，也可以影响一生。\u201d 《人生》开篇引用的这段话，却是这篇小说的最好的一个注解。 《人生》是一部影响了千万青年的励志名篇。阿里巴巴CEO马云说：\u201c路遥对我的影响最大。18岁时，我是蹬天轮的零工，是《人生》改变了我的人生！\u201d 路遥平淡但充满力量的文字，的确影响了很多很多人的人生。而同样出身于农村的我，对路遥的《平凡的世界》和《人生》都极其热爱，因为在其中，我能找到深深的情感寄托与强烈的共鸣\u2026\u2026 《人生》","img":"http://apis.juhe.cn/goodbook/img/df9334eb2d4815be9ab813aac90d2cbe.jpg","reading":"8668人阅读","online":"京东商城:http://book.jd.com/10960247.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22632990 亚马逊:http://www.amazon.cn/dp/B007OQ5A4E","bytime":"2013年3月27日"},{"title":"青铜葵花","catalog":"中国文学 儿童文学 小说 ","tags":"中国文学经典 好书伴我成长 成长小说 经典儿童文学 ","sub1":"美丽的痛苦，诗意的苦难：《青铜葵花》","sub2":"因为曹文轩老师的文学作品一如既往地被广大读者所喜爱，又因为我一如既往地喜欢曹老师的纯美作品，所以在推荐了曹老师的纯美小说《草房子》、《山羊不吃天堂草》、《细米》、《根鸟》之后，我再一次推荐曹文轩老师的这部拥有最美丽的痛苦、最诗意的苦难的儿童文学作品\u2014\u2014《青铜葵花》。 《青铜葵花》是曹文轩老师经历了艰辛而漫长的日子才创作出来的长篇小说。这部小说一如既往地秉承了曹老师的写作风格，纯净、唯美，即使是写苦难，也是那么地富有诗意。《青铜葵花》讲述了一个乡村男孩青铜和城市女孩葵花的感人故事。一次命运的安排，一次特别的机缘，城市女孩葵花来到了不会说哈的乡下男孩青铜的身边，并且成为以兄妹相称的好朋友。他们在大麦地里一起生活，一起长大，青梅竹马。不管是是遭遇洪水还是蝗虫来袭，他们在苦难中彼此鼓励支持，乐观、坚强地成长着。然而，12岁那年，命运将葵花召回了她原本所在的城市，青铜葵花不得不分开。那一次，男孩青铜失去了葵花，不会说话的他竟然开口高喊了一声\u201c葵花\u201d，震撼了所有人的心灵。从此以后，男孩青铜常常遥望着芦荡的尽头，遥望着女孩葵花所在的地方，期盼着她能够归来\u2026\u2026 在《青铜葵花》一书中，曹文轩老师将苦难、大美、至爱三位一体，完美地融合在一起。深刻的大苦难，极致的大美，充满生机与情意的至爱，都在曹老师纯净优雅的笔调下娓娓道来，感人肺腑，震撼人心。作品中的人物形象鲜明独特，意境高雅清远，情感真挚深沉，那唯美的文字，把痛苦写得如此美丽，把苦难写得如此诗意，却更能体现出人间的真情和人道主义的光辉。浓浓的爱意洋溢在整部作品中，直抵人们柔软的心弦，让人忍不住泪流满面\u2026\u2026 《青铜葵花》是曹文轩老师颇为自得的一部心爱之作。书中青铜和葵花经受的苦难和各自显示的风度，时时刻刻都在牵动着读者的心。而曹老师在作品对苦难、对真情、对美好人性的细腻描写和咏叹，像春水般滋润着、温暖着人们的心田，牵引着我们去追寻生命中那永恒的真、善、美。 曹老师说：\u201c每一个时代的人，都有每一个时代的人的痛苦，痛苦绝不是今天的少年才有的。少年时，就有一种对痛苦的风度，长大时才可能是一个强者。\u201d 《青铜葵花》一书呼唤了个人和民族对待苦难时应表现出强劲的风度，让痛苦变美丽，让苦难变诗意。 《青铜葵花》是一部充满力量感的作品，非常值得我们一读再读。 《青铜葵花》","img":"http://apis.juhe.cn/goodbook/img/c21d6b9af21587ad1bc5c50aafb1392a.jpg","reading":"4153人阅读","online":"京东商城:http://book.360buy.com/10016645.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22506352 亚马逊:http://www.amazon.cn/dp/B0011685F4/ 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_564322_.html","bytime":"2013年3月21日"},{"title":"我们仨","catalog":"中国文学 散文 ","tags":"关于亲情的书籍 好书推荐排行榜 家庭生活回忆录 经典散文推荐 ","sub1":"杨绛生活回忆录：《我们仨》","sub2":"《我们仨》是中国著名文学家钱钟书的夫人、中国著名作家杨绛女士撰写的一部家庭生活回忆录。我们仨指的是钱钟书先生、杨绛女士和他们唯一的女儿钱媛。作品记述了他们家庭三口63年来的风雨历程和生活中的点点滴滴。1997年，杨绛唯一的女儿钱媛离她而去；1998年，一生的伴侣丈夫钱钟书也与世长辞。杨绛女士痛失爱女与丈夫的四五年后，也即是其92岁高龄时，用心记录下了他们一家三口共同的生活记忆\u2014\u2014那些快乐而艰难、爱与痛的日子。《我们仨》情感真挚饱满，情节感人肺腑，让人禁不住泪流满面\u2026\u2026 杨绛女士是中国著名的作家、翻译家、评论家和学者，原名杨季康，于1911年7月17日出生在北京，1932年毕业于苏州东吴大学，后与丈夫钱钟书一起到英国、法国留学，回国后在清华大学任教。新中国成立后，杨绛在中国社会科学院文学研究所、外国文学研究所工作。与其丈夫钱钟书一样，杨绛在中国文学界也拥有非常重要的地位。她的经典代表作有《洗澡》、《干校六记》等，剧本著作有《称心如意》、《弄真成假》、《风絮》等，译著有《堂吉诃德》、《吉尔·布拉斯》等。《我们仨》是杨绛女士于2003年发表的散文回忆录，记录了他们一家所经历的风风雨雨，颇为感人。 《我们仨》分为两部分。第一部分讲述的是他们一家三口在最后几年中相依为命的情感体验，第二部分则记录了这个家庭自1935年夫妻二人赴英国留学到1998年钱钟书先生逝世的63年间鲜为人知的坎坷历程。杨绛女士以独特的写法，朴实感人的文字描述了他们一家所经历的战火、疾病、政治风暴和生离死别。无论是暴风抑或是骤雨，他们一家人相濡以沫；无论是酸甜还是苦辣，他们一家人共同品尝。美好的家庭已然是这一家人最安全的庇护所，也是人生最好的庇护所\u2026\u2026 天上人间，阴阳殊途，生离死别，杨绛女士晚年独伴青灯，用心灵、用文字，向逝去的亲人表达着最真挚的爱意和思念。那难以言表的亲情和忧伤弥漫在字里行间，令无数读者动容。 \u201c他已骨瘦如柴，我也老态龙钟。他没有力量说话，还强睁着眼睛招待我。我忽然想到第一次船上相会时，他问我还做梦不做。我这时明白了。我曾做过一个小梦，怪他一声不响地忽然走了。他现在故意慢慢儿走，让我一程一程送，尽量多聚聚，把一个小梦拉成一个万里长梦。这我愿意。送一程，说一声再见，又能见到一面。 离别拉得长，是增加痛苦还是减少痛苦呢？我算不清。但是我陪他走得愈远，愈怕从此不见。\u201d \u201c我一个人思念我们仨。\u201d 这一句，就让我湿了眼角\u2026\u2026 《我们仨》","img":"http://apis.juhe.cn/goodbook/img/241fd5b4053a91a37ac76896328688c9.jpg","reading":"3916人阅读","online":"京东商城:http://book.360buy.com/11096744.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22660863 亚马逊:http://www.amazon.cn/%E6%88%91%E4%BB%AC%E4%BB%A8-%E6%9D%A8%E7%BB%9B/dp/B007TQNFRS","bytime":"2013年3月13日"},{"title":"家","catalog":"中国文学 小说 经典名著 ","tags":"历史小说 反封建主义 好书 巴金 巴金的激流三部曲 文学经典 ","sub1":"巴金巨著：《家》","sub2":"家，是一个很温馨、很温暖的名词，它永远是我们避风的港湾，是我们不舍的牵挂。不管我们走到哪里，都会有一条隐形的线，从家里一直到我们手里，永远都不会断\u2026\u2026而巴金的《家》，却截然相反，不但没有温馨和温暖，而且还让人觉得有点毛骨悚然了。《家》是中国大文豪巴金创作的著名长篇小说，是激流三部曲的第一部。《家》以辛亥革命前后的四川成都为背景，以作者感受至深的老家生活经历为素材，描写了一个正在崩溃的封建大家庭的悲欢离合，在现代文学史上具有很重要的地位。 《家》的作者巴金是中国现代著名的文学家、翻译家和出版家，是20世纪中国杰出的文学大师和中国当代文坛的巨匠。巴金原名李尧棠，四川成都人，于1904年11月25日出生。巴金在一个官僚地主家庭里长大，从小就亲眼目睹了封建社会的种种丑恶现象。1919年的\u201c五四\u201d青年运动让巴金树立了反对封建制度，追求新社会理想的信念。1927年，他赴法留学，回国后积极参与抗日救亡运动，和伟大的文学大师鲁迅来往非常密切。巴金一生创作了许多优秀的文学作品，经典代表作有\u201c激流三部曲\u201d《家》、《春》、《秋》，\u201c爱情三部曲\u201d《雾》、《雨》、《电》和散文集《随想录》等等。巴金拥有\u201c人民作家\u201d、\u201c世纪老人\u201d等称号，于2005年10月17日与世长辞，一代文学巨星陨落，人们无比哀痛。 《家》以细腻的文笔描写了在新的革命时期，高家这个封建官僚大家庭逐渐走向衰败的历史。作品以舒缓自然的生活化结构展现了一个封建官僚家庭全部的生活细节，无情地揭露了封建地主阶级的腐朽、堕落，批判了封建礼教的虚伪、残酷，也表现了叛逆新一代的觉醒和反抗，抒发了渴望新社会、新生活的真挚浓郁的激情。 巴金在《家》一书中以意蕴丰富的细节描写和细腻的心理描写塑造了很多性格鲜明的人物形象：有新思想却又懦弱的觉新、勇于追求爱情和新生活的觉民，激进出走的觉慧、因封建礼教而痛苦惨死的家庭妇女梅和瑞珏等等。书中的人物栩栩如生，跃然于纸上。 《家》是巴金文学道路上树起的第一块丰碑，也是中国现代文学史上最优秀的现实主义杰作之一。让我们一起读巴金的《家》，读巴金的\u201c激流三部曲\u201d，去感受祖辈们反抗封建的毅力和勇气\u2026\u2026","img":"http://apis.juhe.cn/goodbook/img/6509a525ea8e35b52f7ced67b05bb064.jpg","reading":"2603人阅读","online":"京东:http://book.360buy.com/10006069.html 亚马逊:http://www.amazon.cn/%E5%AE%B6-%E5%B7%B4%E9%87%91/dp/B001Q9EJJC/ref=sr_1_6?s=books&amp;ie=UTF8&amp;qid=1360196095&amp;sr=1-6 博库书城:http://detail.bookuu.com/1467790.html","bytime":"2013年2月7日"},{"title":"根鸟","catalog":"中国文学 儿童文学 ","tags":"儿童文学奖 成长小说 推荐好书 经典儿童文学 ","sub1":"曹文轩浪漫小说：《根鸟》","sub2":"《草房子》、《山羊不吃天堂草》、《细米》\u2026\u2026这些拥有唯美名字的儿童文学作品，全部出自曹文轩老师之手。而《根鸟》，是曹文轩老师纯美浪漫小说系列中的又一部经典之作。《根鸟》叙述了一个名叫根鸟的少年梦幻而现实的身心成长史，是一部悠远而精彩的心灵童话。《根鸟》曾获第六届宋庆龄儿童文学奖一等奖和台湾\u201c好书大家读\u201d最佳少年儿童读物奖，赢得了所有孩子（包括小孩子和大孩子）的万般喜爱。 《根鸟》中的少年根鸟梦见了一个美丽的少女，她在悬崖上采花，不慎掉进峡谷里。因为这个梦，根鸟从家乡菊坡出发了。他以梦为马，勇往直前，执着地踏上了未知的旅途，去寻找梦中开满百合花的大峡谷，营救那个叫做紫烟的女孩子。一路上，根鸟走过荒漠、草原、大山、村落、峡谷和小镇······他的旅程奇幻又玄妙，惊险又刺激。一路上困难重重，但他披荆斩棘，丝毫没有放弃。在这个旅程中，根鸟品尝了人生的喜怒哀乐，有过失落与迷茫，最后却仍然坚定、执着地寻找自己的梦想，直到梦想实现的那一刻。根鸟在现实与梦幻之间逐渐成长，在痛苦中收获快乐。 曹文轩老师以唯美的文字描述了一个迷人的、浪漫的、梦幻般的故事。他让我们在梦幻中游走，却在真实中体验人生。他运用了一种童话般美丽、奇幻的写法，却写出了强烈的现实意义。根鸟在鬼谷那艰险的环境中从没想过将梦想放弃，却在幸福温暖的米溪把自己的梦想搁浅了几年，后来又在放纵、享乐的莺店差点把梦想丢失。不过还好，在曾经的旅伴板金的鼓励下，根鸟重新拾起了梦想，继续踏上了寻梦的旅途\u2026\u2026 其实，在每个人的人生旅程中，都会路过类似菊坡、鬼谷、米溪和莺店这样的地方。很多人不是没有梦想，而是梦想很快就在不知不觉中丢失了。也许丢在了安稳的菊坡，也许遗留在艰险的鬼谷，也许搁浅在安逸的米溪，又或许，堕落在放纵、享乐的莺店里。却很少人能够像根鸟一样，实现最初的那个梦想。曹老师笔下的《根鸟》，是一部虚幻而又具有浓重现实感的\u201c成长小说\u201d。在奇妙的故事场景和情节中，蕴涵着强烈的象征意义，让人们在阅读的同时也让各自的心灵洗了一个澡。 曹老师自己评价《根鸟》时说：\u201c意义必须是多面的。可以将它看成是一部情爱的启蒙小说，也可以将它看成是一部思考人生的小说，甚至可以将它看成是一部富有哲学意味的小说。\u201d 读者不同，理解就不同，但是有一样是相同的，那就是我们都要坚定成长中的那个美丽而纯净的梦，以梦为马，勇往直前，去寻找我们心中开满百合花的大峡谷，去营救梦中那个叫紫烟的美丽女孩！ 《根鸟》","img":"http://apis.juhe.cn/goodbook/img/8c4697219f7be84f744dc41115aeaa8f.jpg","reading":"2012人阅读","online":"京东商城:http://book.360buy.com/10016640.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22506351 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_947608_.html 亚马逊:http://www.amazon.cn/dp/B005WOAL6C/","bytime":"2013年2月24日"}],"totalNum":"39","pn":"3","rn":"10"}
     * error_code : 0
     */

    private String resultcode;
    private String reason;
    private ResultBean result;
    private int error_code;

    @Override
    public String toString() {
        return "BookContentEntity{" +
                "resultcode='" + resultcode + '\'' +
                ", reason='" + reason + '\'' +
                ", result=" + result +
                ", error_code=" + error_code +
                '}';
    }

    public String getResultcode() {
        return resultcode;
    }

    public void setResultcode(String resultcode) {
        this.resultcode = resultcode;
    }

    public String getReason() {
        return reason;
    }

    public void setReason(String reason) {
        this.reason = reason;
    }

    public ResultBean getResult() {
        return result;
    }

    public void setResult(ResultBean result) {
        this.result = result;
    }

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public static class ResultBean {
        @Override
        public String toString() {
            return "ResultBean{" +
                    "totalNum='" + totalNum + '\'' +
                    ", pn='" + pn + '\'' +
                    ", rn='" + rn + '\'' +
                    ", data=" + data +
                    '}';
        }

        /**
         * data : [{"title":"于丹：重温最美古诗词","catalog":"中国文学 散文 ","tags":"中国传统文化 古典诗词赏析 好书推荐 文学诗词名著 ","sub1":"《于丹：重温最美古诗词》","sub2":"中国古典文化博大精深、源远流长，特别是古典诗词，堪称中华古典文学的瑰宝。作为一个中国人，诗歌陪伴着我们逐渐成长。小时候，牙牙学语的我们就会摇头晃脑、一本正经地背诵着李白的\u201c床前明月光，疑是地上霜\u201d了；长大一点，我们就在\u201c小荷才露尖尖角\u201d的诗歌中无忧无虑地度过了美好的童年时光；长大后，我们开始在爱情的道路上深情吟唱\u201c春蚕到死丝方尽，蜡炬成灰泪始干\u201d，在忙碌的工作中追求\u201c采菊东篱下，悠然见南山\u201d的悠然\u2026\u2026也许到岁月在我们的脸上刻上深深的皱纹的时候，我们依然会在\u201c流光容易把人抛，红了樱桃，绿了芭蕉\u201d的诗歌中感叹这似水的年华\u2026\u2026林语堂说：\u201c诗歌是中国人的宗教。\u201d 小编觉得，这个比喻还是蛮贴切的。 《于丹：重温最美古诗词》是于丹老师以17年古诗词教学积淀厚积薄发而成的文学著作。于丹老师回归古典文学专业，重温最美古诗词，回归自在大人生，让传统文化的精髓进一步走近大众，走近当下中国人的精神世界。作品中，于丹老师以其独特的人文风格对中国古诗词意象、风骨、内涵、感悟进行了一系列的鉴赏解读，文字清新优美、通俗易懂又妙语连珠，很能激起读者的共鸣。 《于丹：重温最美古诗词》作者于丹，著名文化学者，是北京师范大学教授和博士生导师，更是中国传统文化的研究者和传播者。于丹老师曾在中央电视台《百家讲坛》、《文化视点》等栏目进行系列讲座，掀起学习经典的热潮，在海内外文化界、教育界均产生了广泛的影响。 于丹老师说：\u201c我一直深深地相信，每一个中国人生命的深处都蛰伏着诗意，也许人的年岁越长越需要这样一种温暖，需要我们生命年华中的浪漫，让我们从现实的纠葛中拥有一种挣脱地心引力的力量。\u201d所以，《于丹：重温最美古诗词》一书就让我们重温中国传统文学和古典哲学的精髓所在，找回心灵深处的宁静之美。 \u201c寻常日子一旦有趣，就变得兴味盎然；寻常日子一旦有心，身边处处都是田园。\u201d 不同于安意如的小家碧玉，于丹时而温婉、时而豪放，将\u201c春风飞扬，秋思浩荡，明月千古，斜阳晚钟，田园林泉，登临况味，剑啸长虹，诗酒流连\u201d等解读得淋漓尽致，深入人心，让人沉醉其中，流连忘返\u2026\u2026 《于丹：重温最美古诗词》","img":"http://apis.juhe.cn/goodbook/img/8a0ee76f52d0cf7f28d0eb767946e343.jpg","reading":"8370人阅读","online":"京东商城:http://book.jd.com/10913523.html 当当网:http://product.dangdang.com/product.aspx?product_id=22742915 亚马逊:http://www.amazon.cn/%E4%BA%8E%E4%B8%B9-%E9%87%8D%E6%B8%A9%E6%9C%80%E7%BE%8E%E5%8F%A4%E8%AF%97%E8%AF%8D-%E4%BA%8E%E4%B8%B9/dp/B006Z51Q4I/ref=sr_1_1?ie=UTF8&amp;qid=1367548030&amp;sr=8-1&amp;keywords=%E3%80%8A%E4%BA%8E%E4%B8%B9%EF%BC%9A%E9%87%8D%E6%B8%A9%E6%9C%80%E7%BE%8E%E5%8F%A4%E8%AF%97%E8%AF%8D%E3%80%8B 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_1649112_.html","bytime":"2013年5月3日"},{"title":"许三观卖血记","catalog":"中国文学 小说 ","tags":"中国当代文学 中国文学名著 人生 民间小说 经典好书推荐 ","sub1":"余华巨著：《许三观卖血记》","sub2":"《许三观卖血记》是中国当代著名作家余华于1995年创作的一部长篇小说。作品以博大的温情描绘了磨难中的人生，以激烈的故事形式表达了人在面对厄运时求生的欲望。小说中的人生充满了苦难和痛苦，却渗透了一种契诃夫式的悲悯情绪，令读者一唱三叹、回味无穷。 《许三观卖血记》是一部精妙绝伦的小说，是朴实简洁和内涵意蕴深远的完美结合。作者余华，于1960年出生在浙江杭州，后迁居浙江海盐，现定居浙江杭州。在其青春成长期间，学习了一回鲁迅先生，弃医从文。从文后先后发表了很多作品，被翻译为多种文字，畅销国内外，对社会的影响颇深，因此也获得了许许多多的奖项，享誉中外。其文学代表作有《活着》、《许三观卖血记》、《在细雨中呼喊》、《兄弟》等等。 《许三观卖血记》一书中的故事发生在中国解放初的五六十年代，主人公许三观是一个有着好奇心和责任心的青年，为了生活，他拼命工作，但依然无法保证生活。于是，他就去卖血，靠着卖血，他渡过了人生的一个个难关，也一次次战胜了命运强加给他的惊涛骇浪。后来，他老了，无法卖血了，他坐着哭了，感觉人生走到了尽头\u2026\u2026 在这部感人肺腑的小说里，没有绚烂的情节，有的只是一个简单的民间故事：一个中国家庭忍受贫穷、饥荒以及随后的文化大革命\u2026\u2026虽然小说充满了辛酸，却也不乏幽默之处，这充分展现了余华令人惊悚而滑稽的写作风格。 作者余华说：\u201c这本书其实是一首很长的民歌，它的节奏是回忆的速度，旋律温和地跳跃着，休止符被韵脚隐藏了起来。\u201d 让我们轻轻吟唱起这首民歌，走进这部颇具形式美感的文学作品，去体会中国近代贫苦老百姓们的苦难人生\u2026\u2026 《许三观卖血记》","img":"http://apis.juhe.cn/goodbook/img/3d9a8dd4affd3930ddfb3e056889a56c.jpg","reading":"5350人阅读","online":"京东商城:http://book.jd.com/11139510.html 亚马逊:http://www.amazon.cn/%E8%AE%B8%E4%B8%89%E8%A7%82%E5%8D%96%E8%A1%80%E8%AE%B0-%E4%BD%99%E5%8D%8E/dp/B004TJN5DW/ref=sr_1_2","bytime":"2013年5月22日"},{"title":"世间所有相遇都是久别重逢","catalog":"中国文学 散文 ","tags":"优美散文随笔 古典诗词赏析 好书 散文随笔推荐 禅道 ","sub1":"《世间所有相遇都是久别重逢》","sub2":"\u201c如何让你遇见我？在我最美丽的时刻。 为这，我已在佛前，求了五百年，求它让我们结一段尘缘\u2026\u2026\u201d 一直以来都很喜欢这首诗，席慕容的《一棵开花的树》，每一次轻声念道，心灵都会微微地被触动，升起一股说不出道不明的莫名情绪\u2026\u2026佛说，前世五百年的回眸，才换来今生的擦肩而过。亦有\u201c百年修得同船渡，千年修得共枕眠\u201d一说。前世今生，百转千回，原来世间所有相遇都是久别重逢。或许，五百年前，我就是默默站立在你身旁的那棵树\u2026\u2026 《世间所有相遇都是久别重逢》是享有\u201c落梅风骨，秋水文章\u201d之称的中国作家白落梅以最唯美的文字解读史上最经典的佛诗佛词的一部散文随笔。作品以以禅为经，以诗为纬，编织出一幅最为清新亮丽的画面。白落梅以诗悟禅，以禅入诗，将淡雅之味、悠长之韵、深刻之理、通俗之句皆描绘得淋漓尽致，禅机顿显、诗意盎然，好不惬意。 \u201c文字清淡，心似兰草\u201d的白落梅，原名胥智慧，是一个凌霜傲雪、拣尽梅枝的女子。她的文学作品常见于《读者》等杂志，其散文在CCTV3《电视诗歌散文》栏目中已播出近40篇，出版的代表作有《恍若梦中一相逢》、《烟月不知人事改》、《在最深的红尘里重逢\u2014\u2014仓央嘉措诗传》、《你若安好便是晴天：林徽因传》、《西风多少恨 吹不散眉弯》、《你是锦瑟 我为流年》等等。 在《世间所有相遇都是久别重逢》一书中，隐世才女白落梅以禅意写红尘，以佛法道人生，文字空灵婉约、淡雅脱尘，极富禅意，具有超凡脱俗直指人心的韵味。\u201c我是这样的无意，在一扇半开半掩的轩窗下，让禅意的文字，盛开在许多个宁静的夜里。不是为了给某个故事，埋下深沉的伏笔，只为了在众生的心底，栽种一株菩提。请相信，世间所有相遇，都是久别重逢。也许我是你前世一直无法破解的棋局，你是我今生永远不能猜透的谜底。\u201d\u2026\u2026 一念起，万水千山皆有情；一念灭，沧海桑田已无心。佛说，缘深则聚，缘浅则分，万法随缘，不求则不苦。所以遇见所有遇见的，拥有可以拥有的，忘记需要忘记的，才能换来岁月静好，现世安稳。 因为《世间所有相遇都是久别重逢》 ，所以让我们跟随白落梅的脚步，在那亦禅亦诗、颇具灵性的文字中，去追溯诗缘词梦，去寻找那一次次久别重逢\u2026\u2026 《世间所有相遇都是久别重逢》","img":"http://apis.juhe.cn/goodbook/img/cb3236e4798011682d3d4bff1e575f21.jpg","reading":"10730人阅读","online":"京东商城:http://book.jd.com/10379459.html 当当网:http://product.dangdang.com/product.aspx?product_id=21018087 亚马逊:http://www.amazon.cn/dp/B004HEXD18 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_860946_.html","bytime":"2013年4月4日"},{"title":"京华烟云","catalog":"中国文学 小说 经典名著 ","tags":"中国文学名著 中国近代历史 值得看的好书 小说推荐 经典好书推荐 ","sub1":"现代版\u201c红楼梦\u201d：《京华烟云》","sub2":"《京华烟云》是华语文坛最幽默睿智的一支笔、一代国学大师林语堂先生最负盛名的传世之作，是一部全景式展现中国风云变幻的人文、社会和文化的史诗巨著，更有现代版\u201c红楼梦\u201d的美称。作品讲述了北平曾、姚、牛三大家族从1901年义和团运动到抗日战争30多年间的命运浮沉、悲欢离合和恩怨情仇，曾获得诺贝尔文学奖提名，是一部关于现代中国社会现实的经典小说。 《京华烟云》是国学大师林语堂先生旅居法国巴黎时于1938年8月至1939年8月间用英文创作的长篇小说，原书名为《Moment in Peking》。林语堂先生是中国现代著名的学者、语言学家、文学家和哲学家，他的著名代表作有《京华烟云》、《风声鹤唳》、《吾国与吾民》、《人生不过如此》、《生活的艺术》和《人生的盛宴》等。林语堂先生一生著作等身，享誉中外，在世界文坛上拥有重要的地位。 《京华烟云》是献给\u201c英勇的中国士兵\u201d的一部伟大著作。小说仿照《红楼梦》的结构，以真挚饱满的情感、严肃而又幽默的文笔，讲述了北平曾、姚、牛三大家族30年间的历史变迁，写出了袁世凯篡国、张勋复辟、直奉大战、军阀割据、\u201c五四\u201d运动、\u201c三·一八\u201d惨案、青年\u201c左倾\u201d、二战爆发等近半个世纪的中国历史事件，全面地展现了现代中国真实的社会状况，吸引了一代又一代爱好历史的读者们。 《京华烟云》一书集佳话、哲学、历史演义、风俗变迁、深谈、闲话于一身，再加上剧中人物的喜怒哀乐和过渡时代的中国风貌，俨然成为了现代中国的一本伟大的小说。诺贝尔文学奖获得者赛珍珠评价此书说：\u201c它实事求是，不为真实而羞愧。它写得美妙，既严肃又欢快，对古今中国都能给予正确的理解和评价。我认为这是迄今为止最真实、最深刻、最完备、最重要的一部关于中国的著作。\u201d 《京华烟云》是\u201c林语堂三部曲\u201d之一。本书献词为：\u201c全书写罢泪涔涔，献予歼倭抗日人。不是英雄流热血，神州谁是自由民。\u201d 可见，它是一部饱含深情地献给抗日英雄的巨著。林语堂先生说：\u201c诚盼此书将给予吾人以深刻的启示，将我们深植于往昔的根蒂，开出灿丽的鲜花！\u201d 那么，就让我们走进现代版\u201c红楼梦\u201d\u2014\u2014《京华烟云》，去了解中国历史的变迁，去体会书中人物的悲欢离合，感受他们的酸甜苦辣\u2026\u2026 《京华烟云》","img":"http://apis.juhe.cn/goodbook/img/8de57bb8f82c0f31035d25e48644f3dd.jpg","reading":"3754人阅读","online":"京东商城:http://book.jd.com/10862584.html 当当网:http://product.dangdang.com/product.aspx?product_id=22553275 亚马逊:http://www.amazon.cn/dp/B006BO864G 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_2510555_.html","bytime":"2013年4月12日"},{"title":"倾城之恋","catalog":"中国文学 小说 ","tags":"中国文学经典 好书推荐 爱情 经典爱情小说 ","sub1":"张爱玲著名小说：《倾城之恋》","sub2":"《倾城之恋》是中国现代著名作家张爱玲创作的著名小说，也是她的成名作和经典代表作。《倾城之恋》讲述了一对现实中的庸俗男女在兵荒马乱的战争年代上演的一幕倾城之恋，叙述了一个动听而又近人情的爱情故事。此部作品是张爱玲最脍炙人口的文学著作之一，奠定了张爱玲在中国文坛上的重要地位。 《倾城之恋》的爱情故事发生在香港。女主角白流苏原是上海的白家小姐，在经历过一次失败的婚姻后，身无分文的她备受亲戚们的冷嘲热讽。在她失望之余，从此变得冷漠，看尽世态炎凉。一次偶然的机会，她与男主人公范柳原\u2014\u2014一个多金潇洒的单身汉结识，于是孤注一掷，远赴香港，追求范柳原的爱与婚姻。他们两个情场高手在浅水湾饭店斗智斗勇，最终白流苏服输了。但在日军开始轰炸浅水湾时，范柳原打消了离开的念头，回来保护白流苏。在生死攸关时，两人于\u201c一刹那\u201d间体会到了\u201c一对平凡的夫妻\u201d之间的\u201c一点真心\u201d，最后终于结婚了。但是婚姻并不能改变范柳原之前的生活习惯与作风，白流苏也只能睁只眼闭只眼\u2026\u2026 《倾城之恋》的作者张爱玲是中国现代最重要的作家，也是五四以来最优秀的作家。张爱玲原名张瑛，于1920年9月30日出生在上海公共租界西区。张爱玲家世显赫，童年时光却是黑暗的。她的生母流浪欧洲，她和弟弟是在后娘的监管下长大的，所以导致她的文学作品充满了悲观与势利。张爱玲一生创作了大量的文学作品，有小说、散文、电影剧本以及文学论著等，而她的经典代表作有《金锁记》、《倾城之恋》、《半生缘》和《红玫瑰与白玫瑰》等等。1995年09月08日，张爱玲于洛杉矶加州逝世，享年75岁。 《倾城之恋》是张爱玲最为倾心的作品之一，张爱玲以独特的韵味和情致讲述了一对痴男怨女纠缠不清的爱情故事。著名作家王安忆说：\u201c她有足够的情感能力去抵达深刻，可她没有勇敢承受这种能力所获得的结果，这结果太沉重，她是很知道这分量的。于是她便觉攫住自己，束缚在一些生活的可爱的细节，拼命去吸吮它的实在之处，以免自己再滑到虚无的边缘。\u201d 原本是一场自私而畸形的爱情交易，却因为战争，让两人相嚅以沫、生死相依。\u201c别的她不知道，在这一刹那，她只有他，他也只有她\u2026\u2026\u201d 品读《倾城之恋》，看张爱玲如何看透人性、看透人生\u2026\u2026 《倾城之恋》","img":"http://apis.juhe.cn/goodbook/img/c80c7e316e3dc366ce8b5f321461642f.jpg","reading":"4913人阅读","online":"京东商城:http://book.360buy.com/11020132.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22782677 亚马逊:http://www.amazon.cn/dp/B0084XA1JA 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_2170861_.html","bytime":"2013年3月5日"},{"title":"人生","catalog":"中国文学 小说 经典名著 ","tags":"励志小说 小说排行榜 经典好书推荐 茅盾文学奖 ","sub1":"路遥经典著作：《人生》","sub2":"《人生》是中国当代著名作家路遥的成名作，一部以改革时期陕北高原的城乡生活为背景的优秀中篇小说。作品描写了高中毕业生高加林在农村与城市中几度徘徊的故事，亦描写了高加林同农村姑娘刘巧珍、城市姑娘黄亚萍之间的感情纠葛。小说将理想与现实之间的矛盾描写得淋淋尽致，给人带来一种无奈的无力感的同时，引人深思。 《人生》是真正奠定路遥创作基础的一部经典作品。路遥，原名王卫国，中国当代农村作家，生于1949年陕北一个贫穷的农民家庭里。路遥于1973年进入延安大学中文系学习，在学习期间开始文学创作，后任《陕西文艺》（今为《延河》）编辑。路遥的文学代表作有1982年发表的《人生》、1988年发表的百万字长篇巨著《平凡的世界》等，曾获得第三届茅盾文学奖。 《人生》一书以朴实的语言描写了出生于农村却自信坚毅、拥有远大理想和抱负的主人公高加林离开土地又回到土地、再离开土地再回到土地的命运。高加林辛勤、朴实却心性极高，他不断向命运挑战却最终不得不臣服于命运。小说刻画了他这个复杂矛盾的人物形象，体现了在那个时代背景下那种艰难选择的悲剧。 \u201c人生的道路虽然慢长，但紧要处常常只有几步，特别是当人年轻的时候。没有一个人的生活道路是笔直的，没有岔道的。有些岔道口，譬如政治上的岔口，事业上的岔道口，个人生活上岔道口，你走错一步，可以影响人生的一个时期，也可以影响一生。\u201d 《人生》开篇引用的这段话，却是这篇小说的最好的一个注解。 《人生》是一部影响了千万青年的励志名篇。阿里巴巴CEO马云说：\u201c路遥对我的影响最大。18岁时，我是蹬天轮的零工，是《人生》改变了我的人生！\u201d 路遥平淡但充满力量的文字，的确影响了很多很多人的人生。而同样出身于农村的我，对路遥的《平凡的世界》和《人生》都极其热爱，因为在其中，我能找到深深的情感寄托与强烈的共鸣\u2026\u2026 《人生》","img":"http://apis.juhe.cn/goodbook/img/df9334eb2d4815be9ab813aac90d2cbe.jpg","reading":"8668人阅读","online":"京东商城:http://book.jd.com/10960247.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22632990 亚马逊:http://www.amazon.cn/dp/B007OQ5A4E","bytime":"2013年3月27日"},{"title":"青铜葵花","catalog":"中国文学 儿童文学 小说 ","tags":"中国文学经典 好书伴我成长 成长小说 经典儿童文学 ","sub1":"美丽的痛苦，诗意的苦难：《青铜葵花》","sub2":"因为曹文轩老师的文学作品一如既往地被广大读者所喜爱，又因为我一如既往地喜欢曹老师的纯美作品，所以在推荐了曹老师的纯美小说《草房子》、《山羊不吃天堂草》、《细米》、《根鸟》之后，我再一次推荐曹文轩老师的这部拥有最美丽的痛苦、最诗意的苦难的儿童文学作品\u2014\u2014《青铜葵花》。 《青铜葵花》是曹文轩老师经历了艰辛而漫长的日子才创作出来的长篇小说。这部小说一如既往地秉承了曹老师的写作风格，纯净、唯美，即使是写苦难，也是那么地富有诗意。《青铜葵花》讲述了一个乡村男孩青铜和城市女孩葵花的感人故事。一次命运的安排，一次特别的机缘，城市女孩葵花来到了不会说哈的乡下男孩青铜的身边，并且成为以兄妹相称的好朋友。他们在大麦地里一起生活，一起长大，青梅竹马。不管是是遭遇洪水还是蝗虫来袭，他们在苦难中彼此鼓励支持，乐观、坚强地成长着。然而，12岁那年，命运将葵花召回了她原本所在的城市，青铜葵花不得不分开。那一次，男孩青铜失去了葵花，不会说话的他竟然开口高喊了一声\u201c葵花\u201d，震撼了所有人的心灵。从此以后，男孩青铜常常遥望着芦荡的尽头，遥望着女孩葵花所在的地方，期盼着她能够归来\u2026\u2026 在《青铜葵花》一书中，曹文轩老师将苦难、大美、至爱三位一体，完美地融合在一起。深刻的大苦难，极致的大美，充满生机与情意的至爱，都在曹老师纯净优雅的笔调下娓娓道来，感人肺腑，震撼人心。作品中的人物形象鲜明独特，意境高雅清远，情感真挚深沉，那唯美的文字，把痛苦写得如此美丽，把苦难写得如此诗意，却更能体现出人间的真情和人道主义的光辉。浓浓的爱意洋溢在整部作品中，直抵人们柔软的心弦，让人忍不住泪流满面\u2026\u2026 《青铜葵花》是曹文轩老师颇为自得的一部心爱之作。书中青铜和葵花经受的苦难和各自显示的风度，时时刻刻都在牵动着读者的心。而曹老师在作品对苦难、对真情、对美好人性的细腻描写和咏叹，像春水般滋润着、温暖着人们的心田，牵引着我们去追寻生命中那永恒的真、善、美。 曹老师说：\u201c每一个时代的人，都有每一个时代的人的痛苦，痛苦绝不是今天的少年才有的。少年时，就有一种对痛苦的风度，长大时才可能是一个强者。\u201d 《青铜葵花》一书呼唤了个人和民族对待苦难时应表现出强劲的风度，让痛苦变美丽，让苦难变诗意。 《青铜葵花》是一部充满力量感的作品，非常值得我们一读再读。 《青铜葵花》","img":"http://apis.juhe.cn/goodbook/img/c21d6b9af21587ad1bc5c50aafb1392a.jpg","reading":"4153人阅读","online":"京东商城:http://book.360buy.com/10016645.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22506352 亚马逊:http://www.amazon.cn/dp/B0011685F4/ 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_564322_.html","bytime":"2013年3月21日"},{"title":"我们仨","catalog":"中国文学 散文 ","tags":"关于亲情的书籍 好书推荐排行榜 家庭生活回忆录 经典散文推荐 ","sub1":"杨绛生活回忆录：《我们仨》","sub2":"《我们仨》是中国著名文学家钱钟书的夫人、中国著名作家杨绛女士撰写的一部家庭生活回忆录。我们仨指的是钱钟书先生、杨绛女士和他们唯一的女儿钱媛。作品记述了他们家庭三口63年来的风雨历程和生活中的点点滴滴。1997年，杨绛唯一的女儿钱媛离她而去；1998年，一生的伴侣丈夫钱钟书也与世长辞。杨绛女士痛失爱女与丈夫的四五年后，也即是其92岁高龄时，用心记录下了他们一家三口共同的生活记忆\u2014\u2014那些快乐而艰难、爱与痛的日子。《我们仨》情感真挚饱满，情节感人肺腑，让人禁不住泪流满面\u2026\u2026 杨绛女士是中国著名的作家、翻译家、评论家和学者，原名杨季康，于1911年7月17日出生在北京，1932年毕业于苏州东吴大学，后与丈夫钱钟书一起到英国、法国留学，回国后在清华大学任教。新中国成立后，杨绛在中国社会科学院文学研究所、外国文学研究所工作。与其丈夫钱钟书一样，杨绛在中国文学界也拥有非常重要的地位。她的经典代表作有《洗澡》、《干校六记》等，剧本著作有《称心如意》、《弄真成假》、《风絮》等，译著有《堂吉诃德》、《吉尔·布拉斯》等。《我们仨》是杨绛女士于2003年发表的散文回忆录，记录了他们一家所经历的风风雨雨，颇为感人。 《我们仨》分为两部分。第一部分讲述的是他们一家三口在最后几年中相依为命的情感体验，第二部分则记录了这个家庭自1935年夫妻二人赴英国留学到1998年钱钟书先生逝世的63年间鲜为人知的坎坷历程。杨绛女士以独特的写法，朴实感人的文字描述了他们一家所经历的战火、疾病、政治风暴和生离死别。无论是暴风抑或是骤雨，他们一家人相濡以沫；无论是酸甜还是苦辣，他们一家人共同品尝。美好的家庭已然是这一家人最安全的庇护所，也是人生最好的庇护所\u2026\u2026 天上人间，阴阳殊途，生离死别，杨绛女士晚年独伴青灯，用心灵、用文字，向逝去的亲人表达着最真挚的爱意和思念。那难以言表的亲情和忧伤弥漫在字里行间，令无数读者动容。 \u201c他已骨瘦如柴，我也老态龙钟。他没有力量说话，还强睁着眼睛招待我。我忽然想到第一次船上相会时，他问我还做梦不做。我这时明白了。我曾做过一个小梦，怪他一声不响地忽然走了。他现在故意慢慢儿走，让我一程一程送，尽量多聚聚，把一个小梦拉成一个万里长梦。这我愿意。送一程，说一声再见，又能见到一面。 离别拉得长，是增加痛苦还是减少痛苦呢？我算不清。但是我陪他走得愈远，愈怕从此不见。\u201d \u201c我一个人思念我们仨。\u201d 这一句，就让我湿了眼角\u2026\u2026 《我们仨》","img":"http://apis.juhe.cn/goodbook/img/241fd5b4053a91a37ac76896328688c9.jpg","reading":"3916人阅读","online":"京东商城:http://book.360buy.com/11096744.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22660863 亚马逊:http://www.amazon.cn/%E6%88%91%E4%BB%AC%E4%BB%A8-%E6%9D%A8%E7%BB%9B/dp/B007TQNFRS","bytime":"2013年3月13日"},{"title":"家","catalog":"中国文学 小说 经典名著 ","tags":"历史小说 反封建主义 好书 巴金 巴金的激流三部曲 文学经典 ","sub1":"巴金巨著：《家》","sub2":"家，是一个很温馨、很温暖的名词，它永远是我们避风的港湾，是我们不舍的牵挂。不管我们走到哪里，都会有一条隐形的线，从家里一直到我们手里，永远都不会断\u2026\u2026而巴金的《家》，却截然相反，不但没有温馨和温暖，而且还让人觉得有点毛骨悚然了。《家》是中国大文豪巴金创作的著名长篇小说，是激流三部曲的第一部。《家》以辛亥革命前后的四川成都为背景，以作者感受至深的老家生活经历为素材，描写了一个正在崩溃的封建大家庭的悲欢离合，在现代文学史上具有很重要的地位。 《家》的作者巴金是中国现代著名的文学家、翻译家和出版家，是20世纪中国杰出的文学大师和中国当代文坛的巨匠。巴金原名李尧棠，四川成都人，于1904年11月25日出生。巴金在一个官僚地主家庭里长大，从小就亲眼目睹了封建社会的种种丑恶现象。1919年的\u201c五四\u201d青年运动让巴金树立了反对封建制度，追求新社会理想的信念。1927年，他赴法留学，回国后积极参与抗日救亡运动，和伟大的文学大师鲁迅来往非常密切。巴金一生创作了许多优秀的文学作品，经典代表作有\u201c激流三部曲\u201d《家》、《春》、《秋》，\u201c爱情三部曲\u201d《雾》、《雨》、《电》和散文集《随想录》等等。巴金拥有\u201c人民作家\u201d、\u201c世纪老人\u201d等称号，于2005年10月17日与世长辞，一代文学巨星陨落，人们无比哀痛。 《家》以细腻的文笔描写了在新的革命时期，高家这个封建官僚大家庭逐渐走向衰败的历史。作品以舒缓自然的生活化结构展现了一个封建官僚家庭全部的生活细节，无情地揭露了封建地主阶级的腐朽、堕落，批判了封建礼教的虚伪、残酷，也表现了叛逆新一代的觉醒和反抗，抒发了渴望新社会、新生活的真挚浓郁的激情。 巴金在《家》一书中以意蕴丰富的细节描写和细腻的心理描写塑造了很多性格鲜明的人物形象：有新思想却又懦弱的觉新、勇于追求爱情和新生活的觉民，激进出走的觉慧、因封建礼教而痛苦惨死的家庭妇女梅和瑞珏等等。书中的人物栩栩如生，跃然于纸上。 《家》是巴金文学道路上树起的第一块丰碑，也是中国现代文学史上最优秀的现实主义杰作之一。让我们一起读巴金的《家》，读巴金的\u201c激流三部曲\u201d，去感受祖辈们反抗封建的毅力和勇气\u2026\u2026","img":"http://apis.juhe.cn/goodbook/img/6509a525ea8e35b52f7ced67b05bb064.jpg","reading":"2603人阅读","online":"京东:http://book.360buy.com/10006069.html 亚马逊:http://www.amazon.cn/%E5%AE%B6-%E5%B7%B4%E9%87%91/dp/B001Q9EJJC/ref=sr_1_6?s=books&amp;ie=UTF8&amp;qid=1360196095&amp;sr=1-6 博库书城:http://detail.bookuu.com/1467790.html","bytime":"2013年2月7日"},{"title":"根鸟","catalog":"中国文学 儿童文学 ","tags":"儿童文学奖 成长小说 推荐好书 经典儿童文学 ","sub1":"曹文轩浪漫小说：《根鸟》","sub2":"《草房子》、《山羊不吃天堂草》、《细米》\u2026\u2026这些拥有唯美名字的儿童文学作品，全部出自曹文轩老师之手。而《根鸟》，是曹文轩老师纯美浪漫小说系列中的又一部经典之作。《根鸟》叙述了一个名叫根鸟的少年梦幻而现实的身心成长史，是一部悠远而精彩的心灵童话。《根鸟》曾获第六届宋庆龄儿童文学奖一等奖和台湾\u201c好书大家读\u201d最佳少年儿童读物奖，赢得了所有孩子（包括小孩子和大孩子）的万般喜爱。 《根鸟》中的少年根鸟梦见了一个美丽的少女，她在悬崖上采花，不慎掉进峡谷里。因为这个梦，根鸟从家乡菊坡出发了。他以梦为马，勇往直前，执着地踏上了未知的旅途，去寻找梦中开满百合花的大峡谷，营救那个叫做紫烟的女孩子。一路上，根鸟走过荒漠、草原、大山、村落、峡谷和小镇······他的旅程奇幻又玄妙，惊险又刺激。一路上困难重重，但他披荆斩棘，丝毫没有放弃。在这个旅程中，根鸟品尝了人生的喜怒哀乐，有过失落与迷茫，最后却仍然坚定、执着地寻找自己的梦想，直到梦想实现的那一刻。根鸟在现实与梦幻之间逐渐成长，在痛苦中收获快乐。 曹文轩老师以唯美的文字描述了一个迷人的、浪漫的、梦幻般的故事。他让我们在梦幻中游走，却在真实中体验人生。他运用了一种童话般美丽、奇幻的写法，却写出了强烈的现实意义。根鸟在鬼谷那艰险的环境中从没想过将梦想放弃，却在幸福温暖的米溪把自己的梦想搁浅了几年，后来又在放纵、享乐的莺店差点把梦想丢失。不过还好，在曾经的旅伴板金的鼓励下，根鸟重新拾起了梦想，继续踏上了寻梦的旅途\u2026\u2026 其实，在每个人的人生旅程中，都会路过类似菊坡、鬼谷、米溪和莺店这样的地方。很多人不是没有梦想，而是梦想很快就在不知不觉中丢失了。也许丢在了安稳的菊坡，也许遗留在艰险的鬼谷，也许搁浅在安逸的米溪，又或许，堕落在放纵、享乐的莺店里。却很少人能够像根鸟一样，实现最初的那个梦想。曹老师笔下的《根鸟》，是一部虚幻而又具有浓重现实感的\u201c成长小说\u201d。在奇妙的故事场景和情节中，蕴涵着强烈的象征意义，让人们在阅读的同时也让各自的心灵洗了一个澡。 曹老师自己评价《根鸟》时说：\u201c意义必须是多面的。可以将它看成是一部情爱的启蒙小说，也可以将它看成是一部思考人生的小说，甚至可以将它看成是一部富有哲学意味的小说。\u201d 读者不同，理解就不同，但是有一样是相同的，那就是我们都要坚定成长中的那个美丽而纯净的梦，以梦为马，勇往直前，去寻找我们心中开满百合花的大峡谷，去营救梦中那个叫紫烟的美丽女孩！ 《根鸟》","img":"http://apis.juhe.cn/goodbook/img/8c4697219f7be84f744dc41115aeaa8f.jpg","reading":"2012人阅读","online":"京东商城:http://book.360buy.com/10016640.html 当当网:http://product.dangdang.com/main/product.aspx?product_id=22506351 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_947608_.html 亚马逊:http://www.amazon.cn/dp/B005WOAL6C/","bytime":"2013年2月24日"}]
         * totalNum : 39
         * pn : 3
         * rn : 10
         */



        private String totalNum;
        private String pn;
        private String rn;
        private List<DataBean> data;

        public String getTotalNum() {
            return totalNum;
        }

        public void setTotalNum(String totalNum) {
            this.totalNum = totalNum;
        }

        public String getPn() {
            return pn;
        }

        public void setPn(String pn) {
            this.pn = pn;
        }

        public String getRn() {
            return rn;
        }

        public void setRn(String rn) {
            this.rn = rn;
        }

        public List<DataBean> getData() {
            return data;
        }

        public void setData(List<DataBean> data) {
            this.data = data;
        }

        public static class DataBean {
            /**
             * title : 于丹：重温最美古诗词
             * catalog : 中国文学 散文
             * tags : 中国传统文化 古典诗词赏析 好书推荐 文学诗词名著
             * sub1 : 《于丹：重温最美古诗词》
             * sub2 : 中国古典文化博大精深、源远流长，特别是古典诗词，堪称中华古典文学的瑰宝。作为一个中国人，诗歌陪伴着我们逐渐成长。小时候，牙牙学语的我们就会摇头晃脑、一本正经地背诵着李白的“床前明月光，疑是地上霜”了；长大一点，我们就在“小荷才露尖尖角”的诗歌中无忧无虑地度过了美好的童年时光；长大后，我们开始在爱情的道路上深情吟唱“春蚕到死丝方尽，蜡炬成灰泪始干”，在忙碌的工作中追求“采菊东篱下，悠然见南山”的悠然……也许到岁月在我们的脸上刻上深深的皱纹的时候，我们依然会在“流光容易把人抛，红了樱桃，绿了芭蕉”的诗歌中感叹这似水的年华……林语堂说：“诗歌是中国人的宗教。” 小编觉得，这个比喻还是蛮贴切的。 《于丹：重温最美古诗词》是于丹老师以17年古诗词教学积淀厚积薄发而成的文学著作。于丹老师回归古典文学专业，重温最美古诗词，回归自在大人生，让传统文化的精髓进一步走近大众，走近当下中国人的精神世界。作品中，于丹老师以其独特的人文风格对中国古诗词意象、风骨、内涵、感悟进行了一系列的鉴赏解读，文字清新优美、通俗易懂又妙语连珠，很能激起读者的共鸣。 《于丹：重温最美古诗词》作者于丹，著名文化学者，是北京师范大学教授和博士生导师，更是中国传统文化的研究者和传播者。于丹老师曾在中央电视台《百家讲坛》、《文化视点》等栏目进行系列讲座，掀起学习经典的热潮，在海内外文化界、教育界均产生了广泛的影响。 于丹老师说：“我一直深深地相信，每一个中国人生命的深处都蛰伏着诗意，也许人的年岁越长越需要这样一种温暖，需要我们生命年华中的浪漫，让我们从现实的纠葛中拥有一种挣脱地心引力的力量。”所以，《于丹：重温最美古诗词》一书就让我们重温中国传统文学和古典哲学的精髓所在，找回心灵深处的宁静之美。 “寻常日子一旦有趣，就变得兴味盎然；寻常日子一旦有心，身边处处都是田园。” 不同于安意如的小家碧玉，于丹时而温婉、时而豪放，将“春风飞扬，秋思浩荡，明月千古，斜阳晚钟，田园林泉，登临况味，剑啸长虹，诗酒流连”等解读得淋漓尽致，深入人心，让人沉醉其中，流连忘返…… 《于丹：重温最美古诗词》
             * img : http://apis.juhe.cn/goodbook/img/8a0ee76f52d0cf7f28d0eb767946e343.jpg
             * reading : 8370人阅读
             * online : 京东商城:http://book.jd.com/10913523.html 当当网:http://product.dangdang.com/product.aspx?product_id=22742915 亚马逊:http://www.amazon.cn/%E4%BA%8E%E4%B8%B9-%E9%87%8D%E6%B8%A9%E6%9C%80%E7%BE%8E%E5%8F%A4%E8%AF%97%E8%AF%8D-%E4%BA%8E%E4%B8%B9/dp/B006Z51Q4I/ref=sr_1_1?ie=UTF8&amp;qid=1367548030&amp;sr=8-1&amp;keywords=%E3%80%8A%E4%BA%8E%E4%B8%B9%EF%BC%9A%E9%87%8D%E6%B8%A9%E6%9C%80%E7%BE%8E%E5%8F%A4%E8%AF%97%E8%AF%8D%E3%80%8B 苏宁易购:http://www.suning.com/emall/prd_10052_22001_-7_1649112_.html
             * bytime : 2013年5月3日
             */

            private String title;
            private String catalog;
            private String tags;
            private String sub1;
            private String sub2;
            private String img;
            private String reading;
            private String online;
            private String bytime;

            @Override
            public String toString() {
                return "DataBean{" +
                        "title='" + title + '\'' +
                        ", catalog='" + catalog + '\'' +
                        ", tags='" + tags + '\'' +
                        ", sub1='" + sub1 + '\'' +
                        ", sub2='" + sub2 + '\'' +
                        ", img='" + img + '\'' +
                        ", reading='" + reading + '\'' +
                        ", online='" + online + '\'' +
                        ", bytime='" + bytime + '\'' +
                        '}';
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getCatalog() {
                return catalog;
            }

            public void setCatalog(String catalog) {
                this.catalog = catalog;
            }

            public String getTags() {
                return tags;
            }

            public void setTags(String tags) {
                this.tags = tags;
            }

            public String getSub1() {
                return sub1;
            }

            public void setSub1(String sub1) {
                this.sub1 = sub1;
            }

            public String getSub2() {
                return sub2;
            }

            public void setSub2(String sub2) {
                this.sub2 = sub2;
            }

            public String getImg() {
                return img;
            }

            public void setImg(String img) {
                this.img = img;
            }

            public String getReading() {
                return reading;
            }

            public void setReading(String reading) {
                this.reading = reading;
            }

            public String getOnline() {
                return online;
            }

            public void setOnline(String online) {
                this.online = online;
            }

            public String getBytime() {
                return bytime;
            }

            public void setBytime(String bytime) {
                this.bytime = bytime;
            }
        }
    }
}
