package com.ltqh.qh.entity;

import java.util.List;

public class EastMoneyEntity {

    /**
     * code : 200
     * resultMsg : 请求成功
     * data : ["0#1#2018-10-16 15:37:00【外媒：蔚来汽车与挪威电动车协会签署合作协议】据外媒：蔚来汽车与挪威电动车协会签署合作协议。#####0###20181016153700000000","0#1#2018-10-16 15:23:00【涨停复盘：军民融合、深圳股表现强势 填权概念成市场主线】盘面上，军民融合概念走强，英飞拓、晨曦航空等多股涨停；深圳本地股持续强势，赫美集团、美芝股份、杰恩设计、名雕股份、同益股份等多股涨停；高送转填权概念再度活跃，友迅达、必创科技等多股涨停；天然气板块逆势走强，新疆浩源涨停，大通燃...#####0###20181016152300000000","0#1#2018-10-16 15:15:00【沙特股市开盘大跌4% 】沙特股市开盘大跌4%,此前据媒体报道，沙特政府正准备发表一份声明，承认因对沙特籍记者Jamal Khashoggi审讯不当导致其被误杀（killed by mistake）。#####0###20181016151500000000","0#1#2018-10-16 15:14:00【沙特基准股指开盘大跌4%】沙特基准股指开盘大跌4%。此前据媒体报道，沙特政府准备发表一份声明，承认因对沙特籍记者Jamal Khashoggi审讯不当导致其被误杀(killed by mistake)。#####0###20181016151400000000","0#1#2018-10-16 15:06:00【贝索斯：亚马逊将继续与五角大楼合作】亚马逊公司首席执行长贝索斯称，一些科技公司在退出与五角大楼的合作，但亚马逊不会。贝索斯在旧金山《Wired》杂志25周年纪念活动上表示，一些公司在遭到员工反对后停止了与五角大楼的合作，这令他感到不解。#####0###20181016150600000000","0#1#2018-10-16 15:00:00【收评：三大指数再创调整新低 \"3元股\"数量创9年新高】沪深两市今日平开，早盘沪指在两桶油、大金融等权重股的带领下冲高，一度涨逾1%，随后冲高回落，午后三大指数再现颓势，全线下挫，沪指创调整以来新低，深成指、创业板指创4年半新低，华大基因等创业板权重股惨遭重挫，三元以下股超300只，数量...#####0###20181016150000000000","0#1#2018-10-16 15:00:00【国务院发布同意设立海南自由贸易试验区的批复】国务院关于印发中国（海南）自由贸易试验区总体方案的通知。#####0###20181016150000000000","0#1#2018-10-16 14:48:00【【同花顺·火线】华大基因、康美药业\u201c相约\u201d跌停 闪崩之...】　　2017年7月，作为\u201c基因测序龙头\u201d的华大基因登陆创业板，首发后股价一骑绝尘，连续19个涨停，市值一度过千亿成为资本市场的焦点。　　华大上市后，股价确实创造了神话，市值曾突破千亿人民币大关。不过，随后华大的股价就走向了漫长的调整之...#####0###20181016144800000000","0#1#2018-10-16 14:43:00【小米将于10月25日发布小米MIX  为全球首款5G商用手机】小米将于10月25日发布小米MIX 3，为全球首款5G商用手机。#####0###20181016144300000000","0#1#2018-10-16 14:27:00【OPEC秘书长称到2040年印度石油需求料增长580万桶/日】石油输出国组织(OPEC)秘书长巴尔金都表示，到2040年印度的石油需求料增加580万桶/日，占到同期全球需求增量的40%左右。#####0###20181016142700000000"]
     */

    private int code;
    private String resultMsg;
    private List<String> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getResultMsg() {
        return resultMsg;
    }

    public void setResultMsg(String resultMsg) {
        this.resultMsg = resultMsg;
    }

    public List<String> getData() {
        return data;
    }

    public void setData(List<String> data) {
        this.data = data;
    }
}
